--Задача 4
--Реализовать на языке Haskell функцию, которая разделяет исходный список из целых чисел
--на два списка: список положительных чисел и список отрицательных чисел

split [] = []
split lst = [neg lst] ++ [pos lst]
    where
        neg [] = []
        neg (h:t)
            | h < 0    = h : neg t
            | otherwise = neg t
        pos [] = []
        pos (h:t)
            | h >= 0     = h : pos t
            | otherwise = pos t

--split [1, -1, -2, 3, 4, 1]
--[[-1,-2],[1,3,4,1]]
--split [1, -1, -2, 3, -4, -1, 0, 7]
--[[-1,-2,-4,-1],[1,3,0,7]]
